package java8.inaction.chapter13.part01;

public class SharedVariableData {
	/*
	 * 자신을 포함하는 클래스의 상태와 다른 객체의 상태를 바꾸지 않으며 return 문을 
	 * 통해서만 자신의 결과를 반환하는 메서드를 순수 메서드(Pure Method) 또는 
	 * 부작용이 없는 메서드(side-effect Free Method) 라고 부른다.
	 * 
	 * 부작용 - 적절한 기능이 작동되지 않고 반대의 기능이 발생되는 것 또는 적절치 않은 기능이 발생하는 것
	 * 부작용에 대한 예시
	 * - 자료 구조에 대한 수정
	 * - 생성자, setter 메서드와 같은 동작외 필드에 값을 할당.
	 * - 예외 발생
	 * - 파일에 쓰기 등의 I/O 동작 수행
	 * 
	 * 불변 객체를 이용하여 부작용을 제거할 수도 있다.
	 * 불변 객체의 인스턴스는 객체의 상태를 변경하지 못한다. 또한 함수 동작에 영향 받지 않는다.
	 * 그리고 예상 못한 상태로 바뀌지 않는다.
	 * 이 객체는 복사하지 않고 공유 할 수 있으며, 객체의 상태를 바꿀 수 없어서 스레드 안전성을 제공한다.
	 * 
	 * 부작용이 없는 시스템 컴포넌트에서는 메서드가 서로 간섭하는 일이 없으므로 잠금을 사용하지 않고도
	 * 멀티코어 병렬성을 사용할 수 있다. 또한 프로그램의 어떤 부분이 독립적인지 바로 이해할 수 있다.
	 * 
	 * 부작용이 없는 시스템의 개념은 함수형 프로그래밍에서 유래되었다.
	 */
}
